#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`Success! The configuration is valid.

`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.frontend.aws_wafv2_web_acl.waf_acl: Refreshing state... [id=4e60e6b0-61a3-4a70-9a60-4a252f3e7c7c]
module.frontend.aws_acm_certificate.ssl: Refreshing state... [id=arn:aws:acm:us-east-1:529080338478:certificate/3f355d4e-762e-4305-a1de-b04e42a54abd]
module.frontend.aws_cloudfront_origin_access_identity.oai: Refreshing state... [id=E2KG39NGUA7DI2]
module.frontend.aws_s3_bucket.bucket: Refreshing state... [id=video.rayprogramming.com]
module.frontend.aws_route53_record.ssl_verification["video.rayprogramming.com"]: Refreshing state... [id=Z0504674431EVA0LRLBF__03818f016c5687757483524eb672ebaa.video.rayprogramming.com._CNAME]
module.frontend.aws_acm_certificate_validation.ssl: Refreshing state... [id=2022-01-23 21:54:35.297 +0000 UTC]
module.frontend.aws_route53_record.ssl_verification["www.video.rayprogramming.com"]: Refreshing state... [id=Z0504674431EVA0LRLBF__cb0ab2c26d165a5dbd01aee00ae73bee.www.video.rayprogramming.com._CNAME]
module.frontend.aws_cloudfront_distribution.s3_distribution: Refreshing state... [id=E2QZVOHCSCH69J]
module.frontend.aws_s3_bucket_acl.bucket_acl: Refreshing state... [id=video.rayprogramming.com,private]
module.frontend.aws_s3_bucket_versioning.bucket_version: Refreshing state... [id=video.rayprogramming.com]
module.frontend.aws_s3_bucket_public_access_block.bucket_pab: Refreshing state... [id=video.rayprogramming.com]
module.frontend.aws_s3_bucket_policy.bucket_policy: Refreshing state... [id=video.rayprogramming.com]
module.frontend.aws_route53_record.subdomain_root: Refreshing state... [id=Z0504674431EVA0LRLBF_video.rayprogramming.com_A]
module.frontend.aws_route53_record.subdomain_www: Refreshing state... [id=Z0504674431EVA0LRLBF_www.video.rayprogramming.com_A]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.backend_dev.module.users.aws_cognito_user_pool.user_pool will be created
  + resource "aws_cognito_user_pool" "user_pool" {
      + arn                        = (known after apply)
      + creation_date              = (known after apply)
      + custom_domain              = (known after apply)
      + domain                     = (known after apply)
      + email_verification_message = (known after apply)
      + email_verification_subject = (known after apply)
      + endpoint                   = (known after apply)
      + estimated_number_of_users  = (known after apply)
      + id                         = (known after apply)
      + last_modified_date         = (known after apply)
      + mfa_configuration          = "OFF"
      + name                       = "videoStreamer-dev"
      + sms_verification_message   = (known after apply)
      + tags_all                   = (known after apply)

      + admin_create_user_config {
          + allow_admin_create_user_only = true
        }

      + password_policy {
          + minimum_length                   = (known after apply)
          + require_lowercase                = (known after apply)
          + require_numbers                  = (known after apply)
          + require_symbols                  = (known after apply)
          + require_uppercase                = (known after apply)
          + temporary_password_validity_days = (known after apply)
        }

      + sms_configuration {
          + external_id    = (known after apply)
          + sns_caller_arn = (known after apply)
        }

      + verification_message_template {
          + default_email_option  = (known after apply)
          + email_message         = (known after apply)
          + email_message_by_link = (known after apply)
          + email_subject         = (known after apply)
          + email_subject_by_link = (known after apply)
          + sms_message           = (known after apply)
        }
    }

  # module.backend_dev.module.users.aws_cognito_user_pool_client.client will be created
  + resource "aws_cognito_user_pool_client" "client" {
      + access_token_validity         = 60
      + callback_urls                 = (known after apply)
      + client_secret                 = (sensitive value)
      + enable_token_revocation       = (known after apply)
      + explicit_auth_flows           = [
          + "ALLOW_ADMIN_USER_PASSWORD_AUTH",
          + "ALLOW_CUSTOM_AUTH",
          + "ALLOW_REFRESH_TOKEN_AUTH",
          + "ALLOW_USER_PASSWORD_AUTH",
          + "ALLOW_USER_SRP_AUTH",
        ]
      + generate_secret               = true
      + id                            = (known after apply)
      + id_token_validity             = 60
      + logout_urls                   = (known after apply)
      + name                          = "videoStreamer_dev"
      + prevent_user_existence_errors = (known after apply)
      + read_attributes               = [
          + "address",
          + "birthdate",
          + "email",
          + "email_verified",
          + "family_name",
          + "gender",
          + "given_name",
          + "locale",
          + "middle_name",
          + "name",
          + "nickname",
          + "phone_number",
          + "picture",
          + "preferred_username",
          + "profile",
          + "updated_at",
          + "website",
          + "zoneinfo",
        ]
      + refresh_token_validity        = 30
      + user_pool_id                  = (known after apply)
      + write_attributes              = [
          + "address",
          + "birthdate",
          + "email",
          + "family_name",
          + "gender",
          + "given_name",
          + "locale",
          + "middle_name",
          + "name",
          + "nickname",
          + "phone_number",
          + "picture",
          + "preferred_username",
          + "profile",
          + "updated_at",
          + "website",
          + "zoneinfo",
        ]

      + token_validity_units {
          + access_token  = "minutes"
          + id_token      = "minutes"
          + refresh_token = "days"
        }
    }

  # module.backend_dev.module.users.aws_ssm_parameter.users_client_id will be created
  + resource "aws_ssm_parameter" "users_client_id" {
      + arn         = (known after apply)
      + data_type   = (known after apply)
      + description = "Cognito Client Id for managing users"
      + id          = (known after apply)
      + key_id      = (known after apply)
      + name        = "/videoStreamer/dev/client_id"
      + tags_all    = (known after apply)
      + tier        = "Standard"
      + type        = "String"
      + value       = (sensitive value)
      + version     = (known after apply)
    }

  # module.backend_dev.module.users.aws_ssm_parameter.users_client_secret will be created
  + resource "aws_ssm_parameter" "users_client_secret" {
      + arn         = (known after apply)
      + data_type   = (known after apply)
      + description = "Cognito Client Secret for managing users"
      + id          = (known after apply)
      + key_id      = (known after apply)
      + name        = "/videoStreamer/dev/client_secret"
      + tags_all    = (known after apply)
      + tier        = "Standard"
      + type        = "SecureString"
      + value       = (sensitive value)
      + version     = (known after apply)
    }

  # module.backend_dev.module.users.aws_ssm_parameter.users_pool_id will be created
  + resource "aws_ssm_parameter" "users_pool_id" {
      + arn         = (known after apply)
      + data_type   = (known after apply)
      + description = "Cognito Pool Id for managing users"
      + id          = (known after apply)
      + key_id      = (known after apply)
      + name        = "/videoStreamer/dev/pool_id"
      + tags_all    = (known after apply)
      + tier        = "Standard"
      + type        = "String"
      + value       = (sensitive value)
      + version     = (known after apply)
    }

  # module.backend_dev.module.users.null_resource.build will be created
  + resource "null_resource" "build" {
      + id       = (known after apply)
      + triggers = (known after apply)
    }

  # module.backend_dev.module.users.module.acm.aws_acm_certificate.this[0] will be created
  + resource "aws_acm_certificate" "this" {
      + arn                       = (known after apply)
      + domain_name               = "auth.video.rayprogramming.com"
      + domain_validation_options = [
          + {
              + domain_name           = "auth.video.rayprogramming.com"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = (known after apply)
      + tags                      = {
          + "Env"  = "dev"
          + "Name" = "auth.video.rayprogramming.com"
        }
      + tags_all                  = {
          + "Env"  = "dev"
          + "Name" = "auth.video.rayprogramming.com"
        }
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"

      + options {
          + certificate_transparency_logging_preference = "ENABLED"
        }
    }

  # module.backend_dev.module.users.module.acm.aws_acm_certificate_validation.this[0] will be created
  + resource "aws_acm_certificate_validation" "this" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # module.backend_dev.module.users.module.acm.aws_route53_record.validation[0] will be created
  + resource "aws_route53_record" "validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z0504674431EVA0LRLBF"
    }

  # module.backend_dev.module.users.module.api_gateway.aws_apigatewayv2_api.this[0] will be created
  + resource "aws_apigatewayv2_api" "this" {
      + api_endpoint                 = (known after apply)
      + api_key_selection_expression = "$request.header.x-api-key"
      + arn                          = (known after apply)
      + description                  = "Authentication API"
      + disable_execute_api_endpoint = false
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + name                         = "videoStreamer-dev"
      + protocol_type                = "HTTP"
      + route_selection_expression   = "$request.method $request.path"
      + tags                         = {
          + "Name" = "videoStreamer-dev"
        }
      + tags_all                     = {
          + "Name" = "videoStreamer-dev"
        }

      + cors_configuration {
          + allow_headers = [
              + "authorization",
              + "content-type",
              + "x-amz-date",
              + "x-amz-security-token",
              + "x-amz-user-agent",
              + "x-api-key",
            ]
          + allow_methods = [
              + "*",
            ]
          + allow_origins = [
              + "*",
            ]
        }
    }

  # module.backend_dev.module.users.module.api_gateway.aws_apigatewayv2_api_mapping.this[0] will be created
  + resource "aws_apigatewayv2_api_mapping" "this" {
      + api_id      = (known after apply)
      + domain_name = (known after apply)
      + id          = (known after apply)
      + stage       = (known after apply)
    }

  # module.backend_dev.module.users.module.api_gateway.aws_apigatewayv2_domain_name.this[0] will be created
  + resource "aws_apigatewayv2_domain_name" "this" {
      + api_mapping_selection_expression = (known after apply)
      + arn                              = (known after apply)
      + domain_name                      = "auth.video.rayprogramming.com"
      + id                               = (known after apply)
      + tags                             = {
          + "Name" = "videoStreamer-dev"
        }
      + tags_all                         = {
          + "Name" = "videoStreamer-dev"
        }

      + domain_name_configuration {
          + certificate_arn                        = (known after apply)
          + endpoint_type                          = "REGIONAL"
          + hosted_zone_id                         = (known after apply)
          + ownership_verification_certificate_arn = (known after apply)
          + security_policy                        = "TLS_1_2"
          + target_domain_name                     = (known after apply)
        }
    }

  # module.backend_dev.module.users.module.api_gateway.aws_apigatewayv2_integration.this["POST /confirm"] will be created
  + resource "aws_apigatewayv2_integration" "this" {
      + api_id                                    = (known after apply)
      + connection_type                           = "INTERNET"
      + id                                        = (known after apply)
      + integration_method                        = "POST"
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = (known after apply)
      + integration_uri                           = (known after apply)
      + payload_format_version                    = "2.0"
      + timeout_milliseconds                      = (known after apply)
    }

  # module.backend_dev.module.users.module.api_gateway.aws_apigatewayv2_integration.this["POST /register"] will be created
  + resource "aws_apigatewayv2_integration" "this" {
      + api_id                                    = (known after apply)
      + connection_type                           = "INTERNET"
      + id                                        = (known after apply)
      + integration_method                        = "POST"
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = (known after apply)
      + integration_uri                           = (known after apply)
      + payload_format_version                    = "2.0"
      + timeout_milliseconds                      = (known after apply)
    }

  # module.backend_dev.module.users.module.api_gateway.aws_apigatewayv2_route.this["POST /confirm"] will be created
  + resource "aws_apigatewayv2_route" "this" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "POST /confirm"
      + target             = (known after apply)
    }

  # module.backend_dev.module.users.module.api_gateway.aws_apigatewayv2_route.this["POST /register"] will be created
  + resource "aws_apigatewayv2_route" "this" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "POST /register"
      + target             = (known after apply)
    }

  # module.backend_dev.module.users.module.api_gateway.aws_apigatewayv2_stage.default[0] will be created
  + resource "aws_apigatewayv2_stage" "default" {
      + api_id        = (known after apply)
      + arn           = (known after apply)
      + auto_deploy   = true
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + name          = "$default"
      + tags          = {
          + "Name" = "videoStreamer-dev"
        }
      + tags_all      = {
          + "Name" = "videoStreamer-dev"
        }

      + access_log_settings {
          + destination_arn = (known after apply)
          + format          = (known after apply)
        }
    }

  # module.backend_dev.module.users.module.api_log_group.aws_cloudwatch_log_group.this[0] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "videoStreamer-dev"
      + retention_in_days = 120
      + tags_all          = (known after apply)
    }

  # module.backend_dev.module.users.module.confirm_register_lambda.data.aws_iam_policy_document.assume_role[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "assume_role"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRole",
            ]
          + effect  = "Allow"

          + principals {
              + identifiers = [
                  + "lambda.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.backend_dev.module.users.module.confirm_register_lambda.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.backend_dev.module.users.module.confirm_register_lambda.data.aws_partition.current will be read during apply
  # (config refers to values not yet known)
 <= data "aws_partition" "current"  {
      + dns_suffix         = (known after apply)
      + id                 = (known after apply)
      + partition          = (known after apply)
      + reverse_dns_prefix = (known after apply)
    }

  # module.backend_dev.module.users.module.confirm_register_lambda.data.external.archive_prepare[0] will be read during apply
  # (config refers to values not yet known)
 <= data "external" "archive_prepare"  {
      + id      = (known after apply)
      + program = [
          + "python3",
          + ".terraform/modules/backend_dev.users.confirm_register_lambda/package.py",
          + "prepare",
        ]
      + query   = {
          + "artifacts_dir"            = "builds"
          + "docker"                   = null
          + "hash_extra"               = ""
          + "hash_extra_paths"         = jsonencode([])
          + "paths"                    = jsonencode(
                {
                  + cwd    = "/home/runner/work/videoStreamer/videoStreamer/infrastructure"
                  + module = ".terraform/modules/backend_dev.users.confirm_register_lambda"
                  + root   = "."
                }
            )
          + "recreate_missing_package" = "true"
          + "runtime"                  = "nodejs14.x"
          + "source_path"              = "\".terraform/modules/backend_dev.users/functions/dist/confirmRegistration.js\""
        }
      + result  = (known after apply)
    }

  # module.backend_dev.module.users.module.confirm_register_lambda.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/auth_confirm_register"
      + retention_in_days = 0
      + tags              = {
          + "Name" = "videoStreamer-dev"
        }
      + tags_all          = {
          + "Name" = "videoStreamer-dev"
        }
    }

  # module.backend_dev.module.users.module.confirm_register_lambda.aws_iam_policy.logs[0] will be created
  + resource "aws_iam_policy" "logs" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "auth_confirm_register-logs"
      + path      = "/"
      + policy    = (known after apply)
      + policy_id = (known after apply)
      + tags      = {
          + "Name" = "videoStreamer-dev"
        }
      + tags_all  = {
          + "Name" = "videoStreamer-dev"
        }
    }

  # module.backend_dev.module.users.module.confirm_register_lambda.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "auth_confirm_register"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name" = "videoStreamer-dev"
        }
      + tags_all              = {
          + "Name" = "videoStreamer-dev"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.backend_dev.module.users.module.confirm_register_lambda.aws_iam_role_policy_attachment.logs[0] will be created
  + resource "aws_iam_role_policy_attachment" "logs" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "auth_confirm_register"
    }

  # module.backend_dev.module.users.module.confirm_register_lambda.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + description                    = "Auth register confirm"
      + filename                       = (known after apply)
      + function_name                  = "auth_confirm_register"
      + handler                        = "confirmRegistration.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = true
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs14.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Name" = "videoStreamer-dev"
        }
      + tags_all                       = {
          + "Name" = "videoStreamer-dev"
        }
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage {
          + size = 512
        }

      + tracing_config {
          + mode = "Active"
        }
    }

  # module.backend_dev.module.users.module.confirm_register_lambda.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = (known after apply)
      + id                   = (known after apply)
    }

  # module.backend_dev.module.users.module.confirm_register_lambda.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = (known after apply)
    }

  # module.backend_dev.module.users.module.register_lambda.data.aws_iam_policy_document.assume_role[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "assume_role"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRole",
            ]
          + effect  = "Allow"

          + principals {
              + identifiers = [
                  + "lambda.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.backend_dev.module.users.module.register_lambda.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.backend_dev.module.users.module.register_lambda.data.aws_partition.current will be read during apply
  # (config refers to values not yet known)
 <= data "aws_partition" "current"  {
      + dns_suffix         = (known after apply)
      + id                 = (known after apply)
      + partition          = (known after apply)
      + reverse_dns_prefix = (known after apply)
    }

  # module.backend_dev.module.users.module.register_lambda.data.external.archive_prepare[0] will be read during apply
  # (config refers to values not yet known)
 <= data "external" "archive_prepare"  {
      + id      = (known after apply)
      + program = [
          + "python3",
          + ".terraform/modules/backend_dev.users.register_lambda/package.py",
          + "prepare",
        ]
      + query   = {
          + "artifacts_dir"            = "builds"
          + "docker"                   = null
          + "hash_extra"               = ""
          + "hash_extra_paths"         = jsonencode([])
          + "paths"                    = jsonencode(
                {
                  + cwd    = "/home/runner/work/videoStreamer/videoStreamer/infrastructure"
                  + module = ".terraform/modules/backend_dev.users.register_lambda"
                  + root   = "."
                }
            )
          + "recreate_missing_package" = "true"
          + "runtime"                  = "nodejs14.x"
          + "source_path"              = "\".terraform/modules/backend_dev.users/functions/dist/register.js\""
        }
      + result  = (known after apply)
    }

  # module.backend_dev.module.users.module.register_lambda.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/auth_register"
      + retention_in_days = 0
      + tags              = {
          + "Name" = "videoStreamer-dev"
        }
      + tags_all          = {
          + "Name" = "videoStreamer-dev"
        }
    }

  # module.backend_dev.module.users.module.register_lambda.aws_iam_policy.logs[0] will be created
  + resource "aws_iam_policy" "logs" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "auth_register-logs"
      + path      = "/"
      + policy    = (known after apply)
      + policy_id = (known after apply)
      + tags      = {
          + "Name" = "videoStreamer-dev"
        }
      + tags_all  = {
          + "Name" = "videoStreamer-dev"
        }
    }

  # module.backend_dev.module.users.module.register_lambda.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "auth_register"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name" = "videoStreamer-dev"
        }
      + tags_all              = {
          + "Name" = "videoStreamer-dev"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.backend_dev.module.users.module.register_lambda.aws_iam_role_policy_attachment.logs[0] will be created
  + resource "aws_iam_role_policy_attachment" "logs" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "auth_register"
    }

  # module.backend_dev.module.users.module.register_lambda.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + description                    = "Auth register"
      + filename                       = (known after apply)
      + function_name                  = "auth_register"
      + handler                        = "register.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = true
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs14.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Name" = "videoStreamer-dev"
        }
      + tags_all                       = {
          + "Name" = "videoStreamer-dev"
        }
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage {
          + size = 512
        }

      + tracing_config {
          + mode = "Active"
        }
    }

  # module.backend_dev.module.users.module.register_lambda.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = (known after apply)
      + id                   = (known after apply)
    }

  # module.backend_dev.module.users.module.register_lambda.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = (known after apply)
    }

Plan: 32 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @Rihoj, Action: `pull_request`, Working Directory: ``, Workflow: `Plan`*